In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from IPython.display import HTML

In [4]:
#### DataFrame creation

In [5]:
df = pd.DataFrame({"A": ["boy", "boy", "boy", "boy", "boy",
                         "girl", "girl", "girl", "girl"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C" : ["sports", "non_sports", "sports", "sports", "sports",
                          "non_sports", "non_sports", "sports", "sports"],
                   "D": [50, 55, 67, 85, 44, 84, 65, 56, 87]})

In [6]:
df

      A    B           C   D
0   boy  one      sports  50
1   boy  one  non_sports  55
2   boy  one      sports  67
3   boy  two      sports  85
4   boy  two      sports  44
5  girl  one  non_sports  84
6  girl  one  non_sports  65
7  girl  two      sports  56
8  girl  two      sports  87

In [9]:
##shape
df.shape

(9, 4)

In [10]:
#### Creation of the pivot table
table = pd.pivot_table(df, values='D', index=['A', 'B'], 
                       columns=['C'], aggfunc=np.mean)

In [11]:
table

C         non_sports  sports
A    B
boy  one        55.0    58.5
     two         NaN    64.5
girl one        74.5     NaN
     two         NaN    71.5

#Interactive Pivot Table Using PivotTableJS in Jupyter Notebook

In [ ]:
!pip install pivottablejs

In [13]:
from pivottablejs import pivot_ui

In [16]:
pivot_ui(df,outfile_path='pivottablejs.html')